UNF16.RetailCRMИнтеграция/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="07771644-d1a4-4837-b089-39d71440331e">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>crm_idКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crm_Телефон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crm_idЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crm_СписаноБонусов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БонусныеБаллыПЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c9e93b10-faeb-4204-8870-e79d67281f15">
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6feef6a9-f6b8-4710-9b7a-192d62409e8d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e63ae4c5-4960-4758-b1a5-941e52910bc7">
    <name>ДисконтнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae882be7-c0ea-4171-9749-9e733683f585">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c7e4902-e5a5-4233-97e9-50f06d247628">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6be7ba55-3dee-46a9-9066-3923a1c05e4e">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="335430dd-d274-4cfc-b21f-f6590d358a51">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f587d53-acbe-46d2-aba7-1790f9092e51">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a865ddf8-e589-4a8d-bf8a-2ee9ae7bea85">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5868db51-ee6e-4dc2-8099-a6895fdb0a23">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1690381-edbd-46b0-bec3-422e001c2eba">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="09024e55-1876-43ee-acf6-d8aa0781ff21">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2b0e1066-1596-44ee-b22c-7bc366ed554b">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a261bc-c413-4cfd-b9a7-a7385d1f69eb">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

UNF16.RetailCRMИнтеграция/src/Enums/ТипыДенежныхСредств/ТипыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f99ea38a-e7dd-4cf2-baef-9f45b84e14c5">
  <name>ТипыДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b0b38bad-1d96-4998-b1c0-7fb6ccd93d16">
    <name>Наличные</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af55f18c-5849-41ae-9408-25553d915add">
    <name>Безналичные</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNF16.RetailCRMИнтеграция/src/Enums/ВариантыЗаполненияРасшифровкиПлатежа/ВариантыЗаполненияРасшифровкиПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44dc99c9-e86c-4b30-966a-23d66848b397">
  <name>ВариантыЗаполненияРасшифровкиПлатежа</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="7e245375-ce9b-4484-bcc4-4641099f7f09">
    <name>Просмотр</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a66bd8f3-35a7-4f24-abf0-6f793a6e4687">
    <name>Вручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNF16.RetailCRMИнтеграция/src/Documents/ЧекККМ/Forms/ФормаОплаты/Module.bsl
&НаСервере
Процедура crm_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если 1=0 Тогда
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); // для проверки внедрения БСП
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Получим документ из РМК.
	ТекЗначение = ДанныеФормыВЗначение(Параметры.Объект, Тип("ДокументОбъект.ЧекККМ"));
	ЗначениеВРеквизитФормы(ТекЗначение, "Объект"); // Получим данные документа.
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	// Предопределенные значения
	ТипыДенежныхСредствБезналичные = Перечисления.ТипыДенежныхСредств.Безналичные;
	ТипыДенежныхСредствНаличные = Перечисления.ТипыДенежныхСредств.Наличные;
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	// Заполним временные реквизиты.
	СуммаДокумента = Параметры.СуммаДокумента;
	ВалютаДокумента = Параметры.ВалютаДокумента;
	КассаККМ = Параметры.КассаККМ;
	СформироватьТоварныйЧек = Параметры.СформироватьТоварныйЧек;
	
	// Подключаемое оборудование.
	ИспользоватьПодключаемоеОборудование = Параметры.ИспользоватьПодключаемоеОборудование;
	Объект.ЭквайринговыйТерминал = Параметры.ЭквайринговыйТерминал;
	ЭквайринговыйТерминалПриИзмененииНаСервере();
	
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	КонецЕсли;
	
	КонтрольНаСкладеОтключен = НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить()
						   ИЛИ НЕ Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Получить();
	
	КассаККМИспользоватьБезПодключенияОборудования = КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	Элементы.ГруппаШаблонКартыОплаты.Видимость = Ложь;
	Элементы.ГруппаШаблонСертификатаОплаты.Видимость = Ложь;
	
	// Кнопки командной панели.
	Элементы.ФормаПоказатьВсеРеквизитыШапки.Видимость = ЭтоМобильныйКлиент;
	Элементы.ФормаПрименитьРучнуюСкидку.Видимость = Ложь;
	
	ЗначенияЗаполнения = РабочееМестоКассираВызовСервера.ПолучитьТерминалПоУмолчанию(Объект.КассаККМ);
	Если ЗначенияЗаполнения.КоличествоЭквайринговыхТерминалов = 1 Тогда
		Объект.ЭквайринговыйТерминал = ЗначенияЗаполнения.ЭквайринговыйТерминал;
		ЭквайринговыйТерминалПриИзмененииНаСервере();
		Элементы.ЭквайринговыйТерминал_МК.Видимость = Ложь;
		ДоступенОдинТерминал = Истина;
	КонецЕсли;
	ПолучитьСписокВыбораВидовПлатежныхКарт();
	
	// Обработка карт.
	Если ЭтоМобильныйКлиент Тогда
		ИнициализироватьДанныеОСуммахОплатыНаСервере();
		
		// Дисконтная карта.
		Элементы.ГруппаБонусы.Видимость = Ложь;
		Если НЕ Объект.ДисконтнаяКарта.Пустая() Тогда
			ВыбранаДисконтнаяКартаДополнительноНаСервере();
		КонецЕсли;
	Иначе
		КоличествоКартВДокументе = Параметры.БезналичнаяОплата.Количество();
		Если КоличествоКартВДокументе = 0 И Не ЗначениеЗаполнено(ЭквайринговыйТерминал) И КоличествоТерминаловПоКассе() = 1 Тогда
			Элементы.ГруппаКалькуляторИНомерКарты.Доступность = Истина;
			ДобавитьКартуНаСервере();
			КоличествоКартДляЗаголовка = 0;
		Иначе
			Элементы.ГруппаКалькуляторИНомерКарты.Доступность = Ложь;
			Если КоличествоКартВДокументе = 0 Тогда
				Элементы.НадписьТекущееПолеВвода.Видимость = Ложь;
			Иначе
				Для каждого СтрокаОплатыКартой Из Объект.БезналичнаяОплата Цикл
					НоваяСтрока = ВременнаяТаблицаКарт.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплатыКартой);
					Если СтрокаОплатыКартой.ВидОплаты = Перечисления.ВидыБезналичныхОплат.БанковскаяКарта Тогда
						ДобавитьКартуНаСервере(НоваяСтрока);
					ИначеЕсли СтрокаОплатыКартой.ВидОплаты = Перечисления.ВидыБезналичныхОплат.ПодарочныйСертификат Тогда
						ДобавитьСертификатНаСервере(НоваяСтрока);
					//Radis	
					ИначеЕсли СтрокаОплатыКартой.ВидОплаты = Перечисления.ВидыБезналичныхОплат.Бонусы Тогда
						Идентиф = ВременнаяТаблицаКарт.Индекс(НоваяСтрока);
						СписатьБаллыНаСервере(Идентиф);
						РаспределитьОплатуБонусамиНаСервере();
					КонецЕсли;
					//Radis
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		ОсталосьОплатить = СуммаДокумента - ВременнаяТаблицаКарт.Итог("Сумма") - Объект.Предоплата.Итог("СуммаРасчетов");
	КонецЕсли;
	
	Элементы.ПолученоНаличными.СписокВыбора.Очистить();
	Элементы.ПолученоНаличными.СписокВыбора.Добавить(ОсталосьОплатить, ""+ОсталосьОплатить+" "+ВалютаДокумента);
	
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	// Установка сочетания клавиш
	Для Сч = 0 По 9 Цикл
		Элементы["Кнопка"+Сч].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["Num"+Сч], Ложь, Истина, Ложь);
	КонецЦикла;
	Элементы.РазделительДробнойЧасти.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumDecimal, Ложь, Истина, Ложь);
	Элементы.Сбросить.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.BackSpace, Ложь, Истина, Ложь);
	
	Для Каждого ПодчиненныйЭлемент Из Элементы.ГруппаКартыОплаты.ПодчиненныеЭлементы Цикл
		ПодчиненныйЭлемент.Доступность = ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Или (СтрНайти(ПодчиненныйЭлемент.Имя, "Сертификат") > 0);
	КонецЦикла;
	
	// Блокировка.
	Если Не Объект.Ссылка.Пустая() И Параметры.Свойство("ИдентификаторФормы") Тогда
		Попытка
			РазблокироватьДанныеДляРедактирования(Объект.Ссылка, Параметры.ИдентификаторФормы);
			ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка, , УникальныйИдентификатор); // Блокировка будет снята при закрытии формы.
		Исключение
			//
		КонецПопытки;
	КонецЕсли;
	
	УстановитьВидимостьОтправкиЭлектронныхЧеков();
	
	// Автоматические скидки.
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		Если Объект.СкидкиРассчитаны И Параметры.СуммаДоРасчетаАвтоСкидок <> Объект.Запасы.Итог("Всего") Тогда
			Элементы.НадписьАвтоСкидкиРассчитаны.Заголовок = НСтр("ru = '(автоскидки рассчитаны)'");
		Иначе
			Элементы.НадписьАвтоСкидкиРассчитаны.Заголовок = "";
		КонецЕсли;
	Иначе
		Элементы.НадписьАвтоСкидкиРассчитаны.Заголовок = "";
	КонецЕсли;
	
	УстановитьВидимостьКнопокСНоминалом();
	
	// Взаиморасчеты
	ВариантЗаполненияРасшифровкиПросмотр = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.Просмотр");
	ВариантЗаполненияРасшифровкиВручную = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.Вручную");
	ВзаиморасчетыПриСозданииНаСервере();
	
	УстановитьВидимостьДоговора();
	
	// РаспределениеПродаж
	РаспределениеПродажПриСоздании();
	// Конец РаспределениеПродаж
	
	// Форма оплаты.
	УстановитьВидимостьПриСозданииПоВидуКлиента();
	
	ОбновитьКартинкуВидаСкидки();
КонецПроцедуры
